package de.telran.lesson11;

public class SimpleIf {
    public static void main(String[] args) {
        System.out.println("Программа начала выполняется");
        int myInt = 10;
        if(myInt >= 15) {
            System.out.println("Я попал в If");
        }
        System.out.println("Программа выполняется дальше");
    }
}

/*    Создайте и инициализируйте переменную int = 10
        В блоке if сравните созданную переменную со значением 15
        После блока добавьте инструкцию System.out.println("I am Not in if");
        Проанализируйте вывод*/
